Revit 2024 API
BuiltInFailures.RoofFailures.InvalidArcSegmentation Property
 A segmented slope-defining arc has too few segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidArcSegmentation { get; }
Visual Basic
Public Shared ReadOnly Property InvalidArcSegmentation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidArcSegmentation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace